#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

void test1() {
	// 给定一个不为0的整数，
	// 编写函数找出它值为1的最低有效位(称之为Last Set Bit)。

	// 668
	// 101010111000101010011100000

	// 将这个数右移。 和1 与。 
	// 有个变量，乘2。
}

int find_last_set_bit(int n) {
	return n & (-n);
}

void test2() {
	// n + (-n) === 0

	// 000101010101010111110000001111100000000
	//                           0000100000000

	// 用计数的方式可以分析出来。 
	// 补码： 取反+1

	// 000101010101010111110000001111100000000
	// 111010101010101000001111110000100000000

}


int main(void) {

	return 0;
}